Repository: ElJefeNaidra/User-Management
Catalog: _Resources/Common.*.resx
Languages: sq_al, sr_latn

# ButtonAdd
source: Add New
sq_al: Shto
sr_latn: Dodaj Novo

# ButtonDelete
source: Delete
sq_al: Fshij
sr_latn: Obriši

# ButtonSave
source: Save
sq_al: Ruaj
sr_latn: Sačuvaj

# ButtonUpdate
source: Update
sq_al: Azhuro
sr_latn: Ažuriraj

# DdlChoose
source: - Please choose -
sq_al: - Zgjedh... -
sr_latn: - Molimo izaberite -

# Error500
source: 500: An error has occured!
sq_al: 500: Një gabim është paraqitur!
sr_latn: 500: Došlo je do greške!

# MessageDeletedSuccess
source: Data deleted succesfully
sq_al: Të dhënat janë fshirë me sukses
sr_latn: Podaci su uspešno obrisani

# MessageSavedSuccess
source: Data saved succesfully
sq_al: Të dhënat janë ruajtur me sukses
sr_latn: Podaci su uspešno sačuvani

# Required
source: {0} is required
sq_al: {0} është obligative
sr_latn: {0} je obavezno

# ValidateMultiLangChars
source: Invalid characters in the text only [A-Za-z0-9 \-/,.\çëčćđšžÇËČĆĐŠŽğışüöİĞIŞÜÖ]
sq_al: Karaktere të gabuara në tekst, lejohen vetëm [A-Za-z0-9 \-/,.\çëčćđšžÇËČĆĐŠŽğışüöİĞIŞÜÖ]
sr_latn: Nevažeći karakteri u tekstu samo [A-Za-z0-9 \-/,.\çëčćđšžÇËČĆĐŠŽğışüöİĞIŞÜÖ]

# ValidateSPChars
source: Only A-Z, a-z, 0-9, -,. are allowed
sq_al: Lejohen vetëm A-Z, a-z, 0-9, -,.
sr_latn: Dozvoljeno je samo A-Z, a-z, 0-9, -,.

# ValidationAlphanumeric
source: Only A-Z, a-z and 0-9 are allowed
sq_al: Lejohen vetëm A-Z, a-z dhe 0-9
sr_latn: Dozvoljeno je samo A-Z, a-z i 0-9

# ValidationCurrencyFormat
source: Not a currency format
sq_al: Nuk është format i valutës
sr_latn: Nije ispravan format valute

# ValidationDecimalTwoPlaces
source: The number must have up to two decimal places.
sq_al: Numri duhet ti ketë dy shifra pas presjes dhjetore
sr_latn: Broj mora imati do dve decimalne cifre.

# ValidationEmail
source: Email format is invalid
sq_al: Formati i Email është i gabuar
sr_latn: Format email-a nije ispravan

# ValidationFileMaxSizeType
source: File type is not allowed OR the file size is too large
sq_al: Lloji fajllit nuk lejohet ose madhësia e fajllit është shumë e madhe
sr_latn: Tip fajla nije dozvoljen ILI je veličina fajla prevelika

# ValidationFileType
source: File type should be:
sq_al: Lloji fajllit duhet të jetë:
sr_latn: Tip fajla treba da bude:

# ValidationIntegerRange
source: Value for {0} must be between {1} and {2}.
sq_al: Vlera e {0} duhet të jetë në mes {1} dhe {2}.
sr_latn: Vrednost za {0} mora biti između {1} i {2}.

# ValidationInvalidEmailCharacters
source: Invalid email format characters
sq_al: Karaktere të palejuara në Email adresë
sr_latn: Nevažeći karakteri u formatu email-a

# ValidationInvalidFile
source: Invalid file
sq_al: Fajll i palejuar
sr_latn: Nevažeći fajl

# ValidationIPFormat
source: IP address only allows 0-9 and .
sq_al: IP adresa lejon vetëm 0-9 dhe .
sr_latn: IP adresa dozvoljava samo 0-9 i .

# ValidationKosovoBBAN
source: Invalid BBAN entered
sq_al: BBAN i gabuar
sr_latn: Unet je nevažeći BBAN

# ValidationKosovoPersonalNo
source: Invalid RKS ID entered
sq_al: Nr.Personal i RKS i gabuar
sr_latn: Unet je nevažeći RKS ID

# ValidationKosovoPersonalNoAlgo
source: RKS ID Algorithm fail
sq_al: Algoritmi i Nr.Personal dështoi
sr_latn: RKS ID algoritam nije uspeo

# ValidationKosovoPhoneNo
source: Kosovo Mobile Phone No Invalid
sq_al: Nr. Telefonit mobil të Kosovës nuk është valid
sr_latn: Nevažeći broj mobilnog telefona Kosova

# ValidationMaxFileSize
source: Max file size should be (bytes):
sq_al: Madhësia maksimale e fajllit duhet të jetë (bytes):
sr_latn: Maksimalna veličina fajla treba da bude (bajtovi):

# ValidationMaximumLength
source: {0} should be from {2} to {1} characters long
sq_al: Gjatësia e {0} duhet të jetë nga {2} deri {1} karaktere
sr_latn: {0} treba da bude od {2} do {1} karaktera dugačko

# ValidationMSSQLDatabaseName
source: Invalid MSSQL database name characters entered
sq_al: Karaktere të palejuara në emërtimin e MSSQL databazeës
sr_latn: Uneti su nevažeći karakteri u nazivu MSSQL baze podataka

# ValidationOutOfRange
source: {0} range must be between {1} and {2}
sq_al: Kufiri i {0} duhet të jetë në mes {1} dhe {2}
sr_latn: Opseg {0} mora biti između {1} i {2}

# ValidationPasswordRequired
source: Password is required
sq_al: Fjalëkalimi është obligativ
sr_latn: Lozinka je obavezna

# ValidationPasswordsDoNotMatch
source: New password and conformation do not match
sq_al: Fjalëkalimi i ri dhe komfirmimi nuk përputhen
sr_latn: Nova lozinka i potvrda se ne poklapaju

# ValidationPasswordStrength
source: Password must have at least one uppercase letter, one lowercase letter, one digit, and one special character.
sq_al: Fjalëkalimi duhet të ketë së pagu një shkronjë të vogël; një të madhe; një numër; një shenjë speciale
sr_latn: Lozinka mora imati bar jedno veliko slovo, jedno malo slovo, jednu cifru i jedan poseban karakter.

# ValidationPathChars
source: Invalid Windows path characters entered
sq_al: Karaktere të palejuara në shtegun e formatit të Windows
sr_latn: Uneti su nevažeći karakteri Windows putanje

# ValidationPatternAlphabetSqSrEn
source: Only a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi are allowed
sq_al: Lejohen vetëm a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi
sr_latn: Dozvoljeno je samo a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi

# ValidationRegexLetters
source: Only a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi are allowed
sq_al: Lejohen vetëm a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi
sr_latn: Dozvoljeno je samo a-zA-ZçÇëËčČćĆđĐšŠžŽĞğÖöŞşÜüIıİi

# ValidationRequired
source: {0} is required
sq_al: {0} është obligativ/e
sr_latn: {0} je obavezno

# ValidationUpperCaseLetters
source: Uppercase letters only
sq_al: Lejohen vetëm shkronja të mëdha
sr_latn: Samo velika slova

# ValidationUrlPattern
source: URL cant have those characters
sq_al: URL nuk mund të ketë ato karaktere
sr_latn: URL ne može sadržati te karaktere

# ValidationUsername
source: Invalid username characters entered A-Z 0-9 and . is allowed
sq_al: Karaktere të palejuara janë shkruar. Vetëm A-Z 0-9 dhe . janë të lejuara
sr_latn: Nevažeći karakteri u korisničkom imenu A-Z 0-9 i . su dozvoljeni
